#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HEALTH-IDEAS-APEX.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HEALTH-IDEAS-APEX"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "HealthIdeas Reporting Application - Oracle APEX"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "HEALTH-IDEAS-APEX"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://secure.healthideas.gov.bc.ca/*",
          + "https://securet.healthideas.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HEALTH-IDEAS-APEX.keycloak_openid_user_attribute_protocol_mapper.idir_username will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_username" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_username"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_username"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_username"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HEALTH-IDEAS-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "Health-IDEAS Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HEALTH-IDEAS-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HEALTH-IDEAS.module.client-roles.keycloak_role.ROLES["REPORTS_ADMIN_PRD"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "REPORTS_ADMIN_PRD"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-health-ideas"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-health-ideas"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-health-ideas"
      + realm_id  = "moh_applications"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*